Catalogs/ПравилаПредставленияОтчетовУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПредставленияОтчетовУплатыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиБухгалтера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтставаниеБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИнформацияНаИТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйПервыйНалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасширенногоПервогоНалоговогоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаОтчетаОграничена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьСрокВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПериодИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиСрокНачалаНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяЕдинымПомощником</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьИмяРодительскойЗадачиИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
					<Comment>объединяются по "И"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОснованияПродленияСроков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОблачныеПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОблачныеПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОблачныхПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СообщенияОтчетностиОблачныхПриложенийПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ДоступныеОрганизацииПользователя
//
Процедура ПриПолученииДоступныхОрганизацийПользователя(Организации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ДоступныеОрганизации", Справочники.Организации.ДоступныеОрганизацииПоRLS());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&ДоступныеОрганизации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеОрганизациии = Новый Структура("Наименование, Идентификатор, ИНН, КПП",
			Выборка.Наименование,
			XMLСтрока(Выборка.Ссылка.УникальныйИдентификатор()),
			СокрЛП(Выборка.ИНН),
			СокрЛП(Выборка.КПП));
		Организации.Добавить(ДанныеОрганизациии);
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветДанныеОтчетности
//
Процедура ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор) Экспорт
	
	Организации = Справочники.Организации.ДоступныеОрганизацииПоRLS();
	Если Организации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацииНеЗапрашивать = Новый Массив;
	Для Каждого НеЗапрашивать Из Отбор.ИсключитьОрганизации Цикл
		ИдентификаторОрганизации = Новый УникальныйИдентификатор(НеЗапрашивать);
		ОрганизацииНеЗапрашивать.Добавить(Справочники.Организации.ПолучитьСсылку(ИдентификаторОрганизации));
	КонецЦикла;
	
	Параметры = Обработки.КалендарьОтчетности.НовыйПараметрыОтчета();
	Параметры.Организации = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Организации, ОрганизацииНеЗапрашивать);
	Параметры.ПоОтчетам = Отбор.ПоОтчетам;
	Параметры.ПоТребованиямФНС = Отбор.ПоТребованиямФНС;
	Параметры.ПоУведомлениямЕНС = Отбор.ПоУведомлениямЕНС;
	Параметры.ПоНалоговымПлатежам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ПоНалоговымПлатежам", Ложь);
	Параметры.ПоДокументамСЭДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ПоДокументамСЭДО", Ложь);
	Параметры.ДатаНачала = Отбор.Период.Начало;
	Параметры.ДатаКонца = Отбор.Период.Конец;
	Параметры.НаДату = НачалоДня(ОбщегоНазначенияБП.ТекущаяДатаНаСервере());
	
	ДанныеПриложения = Обработки.КалендарьОтчетности.ДанныеПриложения(Параметры);
	
	// Ссылочные типы не могут быть переданы в ответе в формате JSON.
	ДанныеПриложения.Колонки.Удалить("Организация");
	ДанныеПриложения.Колонки.Удалить("Правило");
	
	Ответ = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеПриложения);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветЗаписатьСтатусОтчета
//
Процедура ПриПодготовкеОтветаЗаписатьСтатусОтчета(Результат, ПараметрыЗапроса) Экспорт
	
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Структура") Тогда
		Результат.Ответ.Причина = Нстр("ru='Параметры запроса должны быть Структура'");
		Возврат;
	КонецЕсли;
	
	Параметры = КалендарьОтчетностиКлиентСервер.НовыйПараметрыЗапросаИзмененияОтчета();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыЗапроса);
	
	ПараметрыОтчета = КалендарьОтчетности.ПодготовитьПараметрыОтчета(Параметры);
	Если ПараметрыОтчета = Неопределено Или Не ЗначениеЗаполнено(ПараметрыОтчета.Организация) Тогда
		Результат.Ответ.Причина = Нстр("ru='Неверно переданы параметры отчета'");
		Возврат;
	КонецЕсли;
	
	ПараметрыДействия = КалендарьОтчетностиКлиентСервер.НовыйПараметрыДействияСОтчетом();
	ЗаполнитьЗначенияСвойств(ПараметрыДействия, Параметры);
	
	// Изменение статуса отчета.
	Если ПараметрыДействия.СтатусУстановленВручную Тогда
		Результат.Ответ.Записан = ВыполнениеЗадачБухгалтера.ЗаписатьРучнойСтатусЗадачи(
			ПараметрыОтчета,
			ПараметрыДействия.Статус);
	Иначе
		Статус = ВыполнениеЗадачБухгалтера.ВернутьАвтоматическийСтатусЗадачи(ПараметрыОтчета);
		Если Статус <> Неопределено Тогда
			Результат.Ответ.Записан = Истина;
			Результат.Ответ.СтатусОтчета = Статус;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Результат.Ответ.Записан Тогда
		Результат.Ответ.Причина = Нстр("ru='Внутренняя ошибка'");
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветЗаписатьСтатусКомментарийОтчета
//
Процедура ПриПодготовкеОтветаЗаписатьКомментарийОтчета(Результат, ПараметрыЗапроса) Экспорт
	
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Структура") Тогда
		Результат.Ответ.Причина = Нстр("ru='Параметры запроса должны быть Структура'");
		Возврат;
	КонецЕсли;
	
	Параметры = КалендарьОтчетностиКлиентСервер.НовыйПараметрыЗапросаИзмененияОтчета();
	ЗаполнитьЗначенияСвойств(Параметры, ПараметрыЗапроса);
	
	ПараметрыОтчета = КалендарьОтчетности.ПодготовитьПараметрыОтчета(Параметры);
	Если ПараметрыОтчета = Неопределено Или Не ЗначениеЗаполнено(ПараметрыОтчета.Организация) Тогда
		Результат.Ответ.Причина = Нстр("ru='Неверно переданы параметры отчета'");
		Возврат;
	КонецЕсли;
	
	ПараметрыДействия = КалендарьОтчетностиКлиентСервер.НовыйПараметрыДействияСОтчетом();
	ЗаполнитьЗначенияСвойств(ПараметрыДействия, Параметры);
	
	// Запись комментария к отчету.
	Результат.Ответ.Записан = ВыполнениеЗадачБухгалтера.ЗаписатьКомментарийЗадачи(ПараметрыОтчета, Параметры.Комментарий);
	Для Каждого ПодчиненноеПравило Из ПараметрыОтчета.ПодчиненныеПравила Цикл
		Параметры = КалендарьОтчетностиКлиентСервер.НовыйПараметрыОтчета();
		ЗаполнитьЗначенияСвойств(Параметры, ПараметрыОтчета);
		Параметры.Правило = ПодчиненноеПравило;
		ВыполнениеЗадачБухгалтера.ЗаписатьКомментарийЗадачи(Параметры, Параметры.Комментарий);
	КонецЦикла;
	
	Если Не Результат.Ответ.Записан Тогда
		Результат.Ответ.Причина = Нстр("ru='Внутренняя ошибка'");
	КонецЕсли;
	
КонецПроцедуры

// Подробнееt
// См. СообщенияОтчетностиОблачныхПриложений.ПравилаПредставленияОтчетовИсполнители
//
Процедура ПриЗаполненииПравилПредставленияОтчетовИсполнители(ИсполнителиПравил) Экспорт
	
	КодыЗадачБухгалтера = Новый Массив;
	КодыЗадачБухгалтера.Добавить("НДФЛ_Агент");
	КодыЗадачБухгалтера.Добавить("СтраховыеВзносы");
	КодыЗадачБухгалтера.Добавить("СтраховыеВзносы_Предприниматель");
	
	ОтчетыСтатистика = Новый Массив;
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2018_П4Квартальная");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_П4");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_П4НЗ");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_1Тчзп");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_1Туст");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_1РабочаяСила");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_3Ф");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_7Травматизм");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ЗПНаука");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ЗПОбразование");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ЗПЗдрав");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ЗПКультура");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ЗПСоц");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2015_57Т");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2023_7ТравматизмПриложение");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2024_1ПР");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_ПМ");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_МПМикро");
	ОтчетыСтатистика.Добавить("СтатистическаяОтчетность.2013_1Квотирование");
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -12)));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(ДобавитьМесяц(ТекущаяДата, 12)));
	Запрос.УстановитьПараметр("КодыЗадачБухгалтера", КодыЗадачБухгалтера);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Владелец.Код КАК ИдентификаторЗадачи,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Код КАК ИдентификаторПравила,
	|	ПравилаПредставленияОтчетовУплатыНалогов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Владелец.РеквизитДопУпорядочивания КАК ВладелецРеквизитДопУпорядочивания
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|ГДЕ
	|	НЕ ПравилаПредставленияОтчетовУплатыНалогов.ПометкаУдаления
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Отчет)
	|	И (ПравилаПредставленияОтчетовУплатыНалогов.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ПравилаПредставленияОтчетовУплатыНалогов.КонецДействия МЕЖДУ &Датаначала И &ДатаОкончания)
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Владелец.Код В(&КодыЗадачБухгалтера)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВладелецРеквизитДопУпорядочивания,
	|	РеквизитДопУпорядочивания";
	
	Правила = Справочники.ПравилаПредставленияОтчетовУплатыНалогов;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяТребования = Правила.СкомпоноватьПолноеИмяПравила(Выборка.ИдентификаторЗадачи, Выборка.ИдентификаторПравила);
		ИмяРеглОтчета = ИнтерфейсыВзаимодействияБРО.ИмяРеглОтчета(ИмяТребования);
		Если ИмяРеглОтчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ИсполнителиПравил.Добавить();
		НоваяСтрока.ИмяПравила   = ИмяТребования;
		НоваяСтрока.ИмяИсточника = ИмяРеглОтчета;
		
	КонецЦикла;
	
	ИдентификаторыПравил = ВыполнениеЗадачБухгалтера.ИдентификаторыПравилВыполняющихсяНеРеглОтчетами();
	Для Каждого СтрокаТаблицы Из ИдентификаторыПравил Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИмяИсточника) Тогда
			Продолжить;
		ИначеЕсли КодыЗадачБухгалтера.Найти(СтрокаТаблицы.ИдентификаторЗадачи) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ИсполнителиПравил.Добавить();
		НоваяСтрока.ИмяПравила   = Правила.СкомпоноватьПолноеИмяПравила(СтрокаТаблицы.ИдентификаторЗадачи, СтрокаТаблицы.ИдентификаторПравила);
		НоваяСтрока.ИмяИсточника = СтрокаТаблицы.ИмяИсточника;
		
	КонецЦикла;
	
	ИсполнителиТребованийРосстата = РегламентированнаяОтчетностьПовтИсп.ИсполнителиТребованийРосстата();
	Для Каждого ИмяПравила Из ОтчетыСтатистика Цикл
		ИмяИсточника = ИсполнителиТребованийРосстата.Получить(ИмяПравила);
		Если ИмяИсточника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ИсполнителиПравил.Добавить();
		НоваяСтрока.ИмяПравила = ИмяПравила;
		НоваяСтрока.ИмяИсточника = ИмяИсточника;
		
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ПодключитьНовыеПриложения
//
Процедура ПриПодключенииНовыхПриложений(ОшибкиПодключения, Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПодключенныеПриложения = РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.Приложения();
	ПодключенныеОрганизации = РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.Организации();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПодключенныеПриложения.Колонки.Добавить("ЕстьВМенеджереСервиса", Новый ОписаниеТипов("Булево"));
	КоличествоПриложений = Параметры.ПриложенияПользователя.Количество();
	
	Счетчик = 0;
	Для Каждого Приложение Из Параметры.ПриложенияПользователя Цикл
		
		Счетчик = Счетчик + 1;
		ДоступноПодключение = СообщенияОблачныхПриложений.ПриложениеГотовоПриниматьЗапросы(
			Приложение.АдресПриложения);
			
		ПроцентВыполнения = Окр(Счетчик / КоличествоПриложений * 100);
		ТекстИдетПодключение = НСтр("ru='Идет подключение приложений...'");
		ТекстОбработано = СтрШаблон(НСтр("ru='Обработано %1 из %2'"), Счетчик, КоличествоПриложений);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,
			СтрШаблон("%1%2%3", ТекстИдетПодключение, Символы.ПС, ТекстОбработано));
		
		ЭлементыАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(Приложение.АдресПриложения);
		ПриложениеПодключено = Ложь;
		Для Каждого ПодключенноеПриложение Из ПодключенныеПриложения Цикл
			Если СтрНайти(Нрег(ПодключенноеПриложение.Адрес), Нрег(ЭлементыАдреса.ПутьНаСервере)) > 0 Тогда
				ПриложениеПодключено = Истина;
				ПодключенноеПриложение.ЕстьВМенеджереСервиса = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДоступноПодключение Тогда
			Если ПриложениеПодключено Тогда
				УстановитьПривилегированныйРежим(Истина);
				РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.ОтключитьПриложение(
					ПодключенноеПриложение.ПриложениеСсылка);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ВидПриложения = Справочники.ОблачныеПриложения.ВидПриложения(Приложение.ИмяВидаПриложения);
		
		Если ПриложениеПодключено Тогда
			// Это приложение уже подключено.
			ПриложениеСсылка = ПодключенноеПриложение.ПриложениеСсылка;
			// Переименуем подключенное приложение, если изменилось его имя.
			Если Приложение.Наименование <> ПодключенноеПриложение.Наименование Тогда
				УстановитьПривилегированныйРежим(Истина);
				Справочники.ОблачныеПриложения.Переименовать(ПриложениеСсылка, Приложение.Наименование);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			// Установим вид приложения, если он не установлен.
			Если Не ЗначениеЗаполнено(ПодключенноеПриложение.Вид) И ЗначениеЗаполнено(ВидПриложения) Тогда
				УстановитьПривилегированныйРежим(Истина);
				Справочники.ОблачныеПриложения.УстановитьВид(ПриложениеСсылка, ВидПриложения, Приложение.НаименованиеВидаПриложения);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			// Обновим список организаций приложения.
			ТипЗапроса = СообщенияОтчетностиОблачныхПриложений.ТипЗапросаСписокОрганизаций();
			Запрос = СообщенияОтчетностиОблачныхПриложений.ЗапроситьСинхронно(ТипЗапроса, ПриложениеСсылка);
			Если Запрос = "" Тогда
				// Доступ к приложению отсутствует. Отключим приложение от Календаря отчетности.
				УстановитьПривилегированныйРежим(Истина);
				РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.ОтключитьПриложение(
					ПриложениеСсылка);
				УстановитьПривилегированныйРежим(Ложь);
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Запрос) = Тип("Строка") Или Запрос = Неопределено Тогда
				// В процессе обновления на Fresh некоторые ноды могут быть ещё не обновлены и не суметь
				// обработать запрос синхронно. Ничего не делаем с такими запросами.
				Продолжить;
			КонецЕсли;
			КалендарьОтчетности.ОбработатьОтветНаЗапросСпискаОрганизаций(
				Запрос.Ответ,
				ПриложениеСсылка,
				ПодключенныеОрганизации);
			Продолжить;
		КонецЕсли;
		
		// Подключаем новое приложение.
		
		ДанныеПодключения = СообщенияОблачныхПриложений.ПодключитьОблачноеПриложение(
			Приложение.АдресПриложения,
			Приложение.Наименование,
			ВидПриложения,
			Приложение.НаименованиеВидаПриложения);
			
		Если ДанныеПодключения = Неопределено Тогда
			ОшибкиПодключения.Добавить(Приложение.Наименование);
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого Организация Из ДанныеПодключения.ДоступныеОрганизации Цикл
			РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.УстановитьСостояние(
				Организация,
				Истина)
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
	
	// Убираем записи, которых нет в менеджере сервиса
	НеактуальныеПриложения = ПодключенныеПриложения.Скопировать(Новый Структура("ЕстьВМенеджереСервиса", Ложь));
	Если НеактуальныеПриложения.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого ПриложениеКУдалению Из НеактуальныеПриложения Цикл
			РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.ОтключитьПриложение(
				ПриложениеКУдалению.ПриложениеСсылка);
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.НовыйПараметрыЗапросаЗаписиСтатусаКомментарияОтчета
//
Процедура ПриЗаполненииПараметровЗапросаЗаписиСтатусаКомментария(Параметры) Экспорт
	
	Параметры.ПараметрыОтчета = КалендарьОтчетностиКлиентСервер.НовыйПараметрыЗапросаИзмененияОтчета();
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ЗапроситьДанныеОтчетнойКампании
//
Процедура ПриЗапросеДанныхОтчетнойКампании(Запрос, ДанныеПриложения, Параметры) Экспорт
	
	ПараметрыЗапроса = СообщенияОтчетностиОблачныхПриложений.НовыйПараметрыЗапросаДанныхОтчетности();
	ПараметрыЗапроса.Отбор.Период.Начало = Параметры.ДатаНачала;
	ПараметрыЗапроса.Отбор.Период.Конец = Параметры.ДатаКонца;
	ПараметрыЗапроса.Отбор.ПоОтчетам = Параметры.ПоОтчетам;
	ПараметрыЗапроса.Отбор.ПоТребованиямФНС = Параметры.ПоТребованиямФНС;
	ПараметрыЗапроса.Отбор.ПоУведомлениямЕНС = Параметры.ПоУведомлениямЕНС;
	ПараметрыЗапроса.Отбор.ПоНалоговымПлатежам = Параметры.ПоНалоговымПлатежам;
	ПараметрыЗапроса.Отбор.ПоДокументамСЭДО = Параметры.ПоДокументамСЭДО;
	ПараметрыЗапроса.Отбор.ПоЗарплате = Параметры.ПоЗарплате;
	
	Если ДанныеПриложения.ПриложениеВид = Перечисления.ВидыОблачныхПриложений.Зарплата Тогда
		ИсполнителиПравил = СообщенияОтчетностиОблачныхПриложений.ПравилаПредставленияОтчетовИсполнители();
		ИдентификаторыОтчетов = ОбщегоНазначения.ВыгрузитьКолонку(ИсполнителиПравил, "ИмяИсточника", Истина);
		ПараметрыЗапроса.Отбор.ИдентификаторыОтчетов = ИдентификаторыОтчетов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Организации = РегистрыСведений.ОрганизацииОтчетностиОблачныхПриложений.Организации();
	УстановитьПривилегированныйРежим(Ложь);
	
	Отбор = Новый Структура("ПриложениеСсылка, ВыводитьВКалендарь", ДанныеПриложения.ПриложениеСсылка, Ложь);
	СтрокиОрганизацииНеЗапрашивать = Организации.НайтиСтроки(Отбор);
	Для Каждого Строка Из СтрокиОрганизацииНеЗапрашивать Цикл
		ПараметрыЗапроса.Отбор.ИсключитьОрганизации.Добавить(Строка.ОрганизацияИдентификатор);
	КонецЦикла;
	
	Запрос = СообщенияОблачныхПриложений.ЗапроситьДанныеПриложения(
		ДанныеПриложения.ПриложениеСсылка,
		СообщенияОтчетностиОблачныхПриложений.ИмяПрикладногоМеханизма(),
		ПараметрыЗапроса);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ПолучитьОтветыНаЗапросы
//
Процедура ПриПолученииОтветовНаЗапросы(Результат, Запросы) Экспорт
	
	Ответы = Новый ТаблицаЗначений;
	Ответы.Колонки.Добавить("Приложение", Новый ОписаниеТипов("СправочникСсылка.ОблачныеПриложения"));
	Ответы.Колонки.Добавить("Данные", Новый ОписаниеТипов("Строка"));
	
	ОжидающиеЗапросы = СообщенияОтчетностиОблачныхПриложений.НовыйЗапросыОблачнымПриложениям();
	ОшибкиПриложений = Новый Массив;
	
	Для Каждого Запрос Из Запросы Цикл
		
		ДанныеПриложения = СообщенияОблачныхПриложений.ПолучитьДанныеПриложения(
			Запрос.Приложение,
			СообщенияОтчетностиОблачныхПриложений.ИмяПрикладногоМеханизма(),
			Запрос.ИдентификаторЗапроса);
			
		Если ДанныеПриложения = Неопределено Тогда
			// Не удалось получить данные, повторять запрос не следует.
			ОшибкиПриложений.Добавить(Запрос.Приложение);
			Продолжить;
			
		ИначеЕсли ДанныеПриложения = "" Тогда
			НоваяСтрока = ОжидающиеЗапросы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Запрос);
			Продолжить;
		КонецЕсли;
		
		Ответ = Ответы.Добавить();
		Ответ.Приложение = Запрос.Приложение;
		Ответ.Данные = ДанныеПриложения;
		
	КонецЦикла;
	
	Результат = Новый Структура("Ответы,ОжидающиеЗапросы,ОшибкиПриложений", Ответы, ОжидающиеЗапросы, ОшибкиПриложений);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.НовыйЗапросыОблачнымПриложениям
//
Процедура ПриЗаполненииНовогоЗапросаОблачнымПриложениям(Запрос) Экспорт
	
	Запрос.Колонки.Добавить("Приложение", Новый ОписаниеТипов("СправочникСсылка.ОблачныеПриложения"));
	Запрос.Колонки.Добавить("ИдентификаторЗапроса", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(36)));
	Запрос.Колонки.Добавить("ТипЗапроса", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(250)));
	
КонецПроцедуры

#КонецОбласти
